YueXianwen/STM32/Intelligent_agriculture/ALINK/Src/usart3.c
/*             实现串口3功能的源文件               */
#include "stm32f10x.h"  //包含需要的头文件
#include "../Inc/usart3.h"     //包含需要的头文件
#include "../Inc/timer4.h"     //包含需要的头文件
#include "../Inc/mqtt.h"

#if  USART3_RX_ENABLE                   //如果使能接收功能
char Usart3_RxCompleted = 0;            //定义一个变量 0：表示接收未完成 1：表示接收完成 
unsigned int Usart3_RxCounter = 0;      //定义一个变量，记录串口2总共接收了多少字节的数据
char Usart3_RxBuff[USART3_RXBUFF_SIZE]; //定义一个数组，用于保存串口2接收到的数据   	
#endif

/*-------------------------------------------------*/
/*函数名：初始化串口2发送功能                      */
/*参  数：bound：波特率                            */
/*返回值：无                                       */
/*-------------------------------------------------*/
void Usart3_Init(unsigned int bound)
{  	 	
	GPIO_InitTypeDef GPIO_InitStructure;      //定义一个设置GPIO功能的变量
	USART_InitTypeDef USART_InitStructure;    //定义一个设置串口功能的变量
	
#if USART3_RX_ENABLE                          //如果使能接收功能
	 NVIC_InitTypeDef NVIC_InitStructure;     //如果使能接收功能，定义一个设置中断的变量
#endif

#if USART3_RX_ENABLE                                 //如果使能接收功能
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  //设置中断向量分组：第2组 抢先优先级：0 1 2 3 子优先级：0 1 2 3
#endif	
      
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3,ENABLE);  //使能串口2时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);   //使能GPIOA时钟
	
	USART_DeInit(USART3);                                  //串口2寄存器重新设置为默认值
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;                //准备设置PA2   TX
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;      //IO速率50M
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;	       //复用推挽输出，用于串口2的发送
	GPIO_Init(GPIOB, &GPIO_InitStructure);                   //设置PA2
   
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;                //准备设置PA3   RX
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;    //浮空输入，用于串口2的接收
	GPIO_Init(GPIOB, &GPIO_InitStructure);                   //设置PA3
	
	USART_InitStructure.USART_BaudRate = bound;                                    //波特率设置
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;                    //8个数据位
	USART_InitStructure.USART_StopBits = USART_StopBits_1;                         //1个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;                            //无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
	
#if USART3_RX_ENABLE               												   //如果使能接收模式
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;	               //收发模式
#else                                                                              //如果不使能接收模式
	USART_InitStructure.USART_Mode = USART_Mode_Tx ;	                           //只发模式
#endif 

    USART_Init(USART3, &USART_InitStructure);                                      //设置串口2	

#if USART3_RX_ENABLE  	         					        //如果使能接收模式
	USART_ClearFlag(USART3, USART_FLAG_RXNE);	            //清除接收标志位
	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);          //开启接收中断
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;       //设置串口2中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0; //抢占优先级0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority =0;		//子优先级0
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//中断通道使能
	NVIC_Init(&NVIC_InitStructure);	                        //设置串口2中断
#endif  

	USART_Cmd(USART3, ENABLE);                              //使能串口2
	
}

/*-------------------------------------------------*/
/*函数名：串口2 printf函数                         */
/*参  数：char* fmt,...  格式化输出字符串和参数    */
/*返回值：无                                       */
/*-------------------------------------------------*/
char USART3_TxBuff[USART3_TXBUFF_SIZE];

void u3_printf(char* fmt,...) 
{  
	unsigned int i,length;
	
	va_list ap;
	va_start(ap,fmt);
	vsprintf(USART3_TxBuff,fmt,ap);
	va_end(ap);	
	
	length=strlen((const char*)USART3_TxBuff);		
	while((USART3->SR&0X40)==0);
	for(i = 0;i < length;i ++)
	 {			
		USART3->DR = USART3_TxBuff[i];
		while((USART3->SR&0X40)==0);	
	 }	
}

/*-------------------------------------------------*/
/*函数名：串口2发送缓冲区中的数据                  */
/*参  数：data：数据                               */
/*返回值：无                                       */
/*-------------------------------------------------*/
void u3_TxData(unsigned char *data)
{
	int	i;	
	while((USART3->SR&0X40)==0);
	for(i = 1;i <= (data[0]*256+data[1]);i++)  //gwd 待发送数据的大小存在待发送数据的前2个字节中，以此来进行数据的发送
	{			
		USART3->DR = data[i+1];                //gwd 一次性发送1个字节
		while((USART3->SR&0X40)==0);	       //gwd 等待发送完成
	} 
}

/*-------------------------------------------------*/
/*函数名：串口2中断处理函数                        */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void USART3_IRQHandler(void)   
{                      
	if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)   //如果USART_IT_RXNE标志置位，表示有数据到了，进入if分支
	{
		if(Connect_flag==0)                                 //如果Connect_flag等于0，当前还没有连接服务器，处于指令配置状态
		{
			if(USART3->DR){                                 //处于指令配置状态时，非零值才保存到缓冲区	
				Usart3_RxBuff[Usart3_RxCounter]=USART3->DR; //保存到缓冲区	
				Usart3_RxCounter ++;                        //每接收1个字节的数据，Usart2_RxCounter加1，表示接收的数据总量+1 
			}		
		}
		else
		{		                                                   //反之Connect_flag等于1，连接上服务器了	
			Usart3_RxBuff[Usart3_RxCounter] = USART3->DR;          //把接收到的数据保存到Usart2_RxBuff中	
			
			if(Usart3_RxCounter == 0)
				{    					             //如果Usart2_RxCounter等于0，表示是接收的第1个数据，进入if分支				
				TIM_Cmd(TIM4,ENABLE); 
				}
			else
				{                        					             //else分支，表示果Usart2_RxCounter不等于0，不是接收的第一个数据
				TIM_SetCounter(TIM4,0);  
				}	
			Usart3_RxCounter++;         				             //每接收1个字节的数据，Usart2_RxCounter加1，表示接收的数据总量+1 
	  }
	}
}



